-- MySQL dump 10.13  Distrib 8.0.45, for macos15 (arm64)
--
-- Host: localhost    Database: db
-- ------------------------------------------------------
-- Server version	8.0.45

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `db`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `db` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `db`;

--
-- Table structure for table `course_categories`
--

DROP TABLE IF EXISTS `course_categories`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `course_categories` (
  `category_id` int NOT NULL AUTO_INCREMENT,
  `main_type` varchar(50) NOT NULL,
  `sub_type` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`category_id`),
  KEY `ix_course_categories_category_id` (`category_id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `course_categories`
--

LOCK TABLES `course_categories` WRITE;
/*!40000 ALTER TABLE `course_categories` DISABLE KEYS */;
INSERT INTO `course_categories` VALUES (1,'必修','一般必修'),(2,'必修','群A'),(3,'必修','群B'),(4,'必修','群C'),(5,'選修',NULL),(6,'通識','中文通識'),(7,'通識','自然通識'),(8,'通識','社會通識'),(9,'通識','人文通識'),(10,'通識','資訊通識'),(11,'通識','書院通識'),(12,'核心通識','自然'),(13,'核心通識','社會'),(14,'核心通識','人文'),(15,'英文',NULL),(16,'體育',NULL);
/*!40000 ALTER TABLE `course_categories` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `course_category_mappings`
--

DROP TABLE IF EXISTS `course_category_mappings`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `course_category_mappings` (
  `course_id` varchar(20) NOT NULL,
  `category_id` int NOT NULL,
  PRIMARY KEY (`course_id`,`category_id`),
  KEY `category_id` (`category_id`),
  CONSTRAINT `course_category_mappings_ibfk_1` FOREIGN KEY (`course_id`) REFERENCES `courses` (`course_id`),
  CONSTRAINT `course_category_mappings_ibfk_2` FOREIGN KEY (`category_id`) REFERENCES `course_categories` (`category_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `course_category_mappings`
--

LOCK TABLES `course_category_mappings` WRITE;
/*!40000 ALTER TABLE `course_category_mappings` DISABLE KEYS */;
INSERT INTO `course_category_mappings` VALUES ('000713021',1),('000713022',1),('703001001',1),('703002001',1),('703007001',1),('703008001',1),('703009001',1),('703014001',1),('703015001',1),('703016001',1),('703017001',1),('703019001',1),('703022001',1),('703049001',1),('703050001',1),('703044001',2),('703046001',2),('703047001',2),('703025001',3),('703027001',3),('703038001',3),('703039001',3),('703055001',3),('703060001',3),('703010001',4),('703042001',4),('703053001',4),('703059001',4),('002888001',5),('031004011',6),('031004051',6),('031004061',6),('031004081',6),('031004091',6),('031004101',6),('031004111',6),('031007011',6),('031008011',6),('031008021',6),('031008031',6),('031008041',6),('031008051',6),('031013011',6),('031013041',6),('031014161',6),('031014171',6),('031015011',6),('031017101',6),('031017111',6),('031017121',6),('031017131',6),('031017141',6),('031017151',6),('031023001',6),('031023011',6),('031023021',6),('031024001',6),('031025001',6),('031026001',6),('031027001',6),('043016001',7),('043016011',7),('043021001',7),('043024001',7),('043025001',7),('043025011',7),('043027001',7),('043030001',7),('043031001',7),('043033001',7),('043042001',7),('043045001',7),('043048001',7),('090014011',7),('090020001',7),('090033001',7),('090044001',7),('090060001',7),('090060011',7),('090060021',7),('090088001',7),('090104001',7),('090106001',7),('090109001',7),('090111001',7),('090114001',7),('993015001',7),('042051001',8),('042053001',8),('042089001',8),('042096001',8),('042103001',8),('042112091',8),('042116011',8),('042116041',8),('042131001',8),('042133001',8),('042133011',8),('042137001',8),('042137011',8),('042139021',8),('042142001',8),('042142011',8),('042156001',8),('042156021',8),('042156031',8),('042156051',8),('042166001',8),('042181001',8),('042181011',8),('042183001',8),('042194001',8),('042195001',8),('042198001',8),('042200001',8),('042201001',8),('042207001',8),('042215001',8),('042217001',8),('042219001',8),('042220001',8),('042221001',8),('042222001',8),('090126001',8),('041026011',9),('041038001',9),('041095001',9),('041097001',9),('041099041',9),('041099061',9),('041100001',9),('041116001',9),('041123001',9),('041125001',9),('041133011',9),('041135001',9),('041135011',9),('041172001',9),('041177001',9),('041177011',9),('041177021',9),('041179001',9),('041187001',9),('041191001',9),('041195001',9),('041195011',9),('041207001',9),('041211001',9),('041214001',9),('041215001',9),('041216001',9),('041217001',9),('090066001',9),('090101001',9),('090112001',9),('090123001',9),('993031001',9),('046001001',10),('046001011',10),('046001021',10),('046001031',10),('046005001',10),('046006011',10),('046006031',10),('046008001',10),('046008011',10),('046008021',10),('046009001',10),('046010001',10),('090129001',10),('045023001',11),('045024011',11),('045025001',11),('045062001',11),('045064001',11),('045065001',11),('043016001',12),('043016011',12),('043024001',12),('043025001',12),('043025011',12),('043027001',12),('043030001',12),('043031001',12),('042112091',13),('042116011',13),('042116041',13),('042133001',13),('042133011',13),('042137001',13),('042137011',13),('042139021',13),('042142001',13),('042142011',13),('042156001',13),('042156021',13),('042156031',13),('042156051',13),('042181001',13),('042181011',13),('041099041',14),('041099061',14),('041100001',14),('041123001',14),('041133011',14),('041135001',14),('041135011',14),('041177001',14),('041177011',14),('041177021',14),('041195001',14),('041195011',14),('032001011',15),('032001021',15),('032001031',15),('032001041',15),('032001051',15),('032001061',15),('032001071',15),('032001081',15),('032001091',15),('032001201',15),('032001211',15),('032001221',15),('032001231',15),('032001241',15),('032001251',15),('032001261',15),('032001271',15),('032001281',15),('032001291',15),('032001301',15),('032001311',15),('032001401',15),('032001411',15),('032001421',15),('032001431',15),('032001441',15),('032001451',15),('032001461',15),('032001471',15),('032001481',15),('032001491',15),('032001501',15),('032001511',15),('032001601',15),('032001611',15),('032001621',15),('032001631',15),('032001641',15),('032001651',15),('032001661',15),('032001671',15),('032001681',15),('032001691',15),('032001701',15),('032001711',15),('032001801',15),('032001811',15),('032001821',15),('032001831',15),('032001841',15),('032001881',15),('032001901',15),('032001911',15),('032001921',15),('032001931',15),('032001941',15),('032001951',15),('032002011',15),('032002021',15),('032002031',15),('032002041',15),('032002051',15),('032002061',15),('032002071',15),('032002081',15),('032002091',15),('032002201',15),('032002211',15),('032002221',15),('032002231',15),('032002241',15),('032002251',15),('032002261',15),('032002271',15),('032002281',15),('032002291',15),('032002301',15),('032002401',15),('032002411',15),('032002421',15),('032002431',15),('032002441',15),('032002451',15),('032002461',15),('032002471',15),('032002481',15),('032002491',15),('032002501',15),('032002511',15),('032002601',15),('032002611',15),('032002621',15),('032002631',15),('032002641',15),('032002651',15),('032002661',15),('032002671',15),('032002681',15),('032002691',15),('032002701',15),('032002711',15),('032002801',15),('032002811',15),('032002821',15),('032002831',15),('032002841',15),('032002881',15),('032002901',15),('032002911',15),('032002921',15),('032002931',15),('032002941',15),('032002951',15),('002008011',16),('002009001',16),('002012011',16),('002012021',16),('002021011',16),('002021021',16),('002051001',16),('002060001',16),('002062011',16),('002062031',16),('002062041',16),('002065011',16),('002065021',16),('002071011',16),('002076011',16),('002097021',16),('002112001',16),('002112011',16),('002113011',16),('002115001',16),('002151001',16),('002301001',16),('002301021',16),('002301031',16),('002303011',16),('002303021',16),('002303041',16),('002303051',16),('002303061',16),('002303071',16),('002303081',16),('002305021',16),('002305031',16),('002311021',16),('002311031',16),('002311041',16),('002312001',16),('002325011',16),('002327001',16),('002327011',16),('002328001',16),('002329001',16),('002334001',16),('002335001',16),('002335011',16),('002335021',16),('002337001',16),('002337011',16),('002338001',16),('002339001',16),('002339011',16),('002339031',16),('002339041',16),('002340011',16),('002340021',16),('002341001',16),('002342001',16),('002343001',16),('002343011',16),('002346001',16),('002347001',16),('002347021',16),('002348001',16),('002348011',16),('002350001',16),('002350011',16),('002355001',16),('002361011',16),('002361021',16),('002362001',16),('002362011',16),('002362021',16),('002363001',16),('002366001',16),('002366011',16),('002366041',16),('002366071',16),('002367001',16),('002368001',16),('002368011',16),('002368021',16),('002369001',16),('002371001',16),('002371011',16),('002373001',16),('002373011',16),('002374001',16),('002374011',16),('002377001',16),('002378001',16),('002378011',16),('002380001',16),('002380011',16),('002380021',16),('002383001',16),('002384001',16),('002386001',16),('002387001',16),('002387011',16),('002390001',16),('002390011',16);
/*!40000 ALTER TABLE `course_category_mappings` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `courses`
--

DROP TABLE IF EXISTS `courses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `courses` (
  `course_id` varchar(20) NOT NULL,
  `course_name` varchar(100) NOT NULL,
  `credits` int NOT NULL,
  `taught_by` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`course_id`),
  KEY `ix_courses_course_id` (`course_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `courses`
--

LOCK TABLES `courses` WRITE;
/*!40000 ALTER TABLE `courses` DISABLE KEYS */;
INSERT INTO `courses` VALUES ('000713021','微積分甲 (Calculus I)',3,NULL),('000713022','微積分甲 (Calculus II)',3,NULL),('002008011','體育[男女合班]—健康體適能',0,NULL),('002009001','體育[男女合班]—適應體育',0,NULL),('002012011','體育[男]—羽球初級',0,NULL),('002012021','體育[男]—羽球初級',0,NULL),('002021011','體育[男]—籃球初級',0,NULL),('002021021','體育[男]—籃球初級',0,NULL),('002051001','體育[男]—羽球中級',0,NULL),('002060001','體育[男]—游泳初級（捷泳）',0,NULL),('002062011','體育[女]—羽球初級',0,NULL),('002062031','體育[女]—羽球初級',0,NULL),('002062041','體育[女]—羽球初級',0,NULL),('002065011','體育[女]—桌球初級',0,NULL),('002065021','體育[女]—桌球初級',0,NULL),('002071011','體育[女]—籃球初級',0,NULL),('002076011','體育[女]—游泳初級',0,NULL),('002097021','體育[女]—排球初級',0,NULL),('002112001','體育[女]—女體適能',0,NULL),('002112011','體育[女]—女體適能',0,NULL),('002113011','體育[女]—籃球中級',0,NULL),('002115001','體育[女]—羽球中級',0,NULL),('002151001','體育[女]—排球中級',0,NULL),('002301001','體育[男女合班]—網球初級',0,NULL),('002301021','體育[男女合班]—網球初級',0,NULL),('002301031','體育[男女合班]—網球初級',0,NULL),('002303011','體育[男女合班]—桌球初級',0,NULL),('002303021','體育[男女合班]—桌球初級',0,NULL),('002303041','體育[男女合班]—桌球初級',0,NULL),('002303051','體育[男女合班]—桌球初級',0,NULL),('002303061','體育[男女合班]—桌球初級',0,NULL),('002303071','體育[男女合班]—桌球初級',0,NULL),('002303081','體育[男女合班]—桌球初級',0,NULL),('002305021','體育[男女合班]—慢速壘球初級',0,NULL),('002305031','體育[男女合班]—慢速壘球初級',0,NULL),('002311021','體育[男女合班]—足球初級',0,NULL),('002311031','體育[男女合班]—足球初級',0,NULL),('002311041','體育[男女合班]—足球初級',0,NULL),('002312001','體育[男]—男體適能',0,NULL),('002325011','體育[男女合班]—排球中級',0,NULL),('002327001','體育[男女合班]—排球初級',0,NULL),('002327011','體育[男女合班]—排球初級',0,NULL),('002328001','體育[男女合班]—足球中級',0,NULL),('002329001','體育[男]—籃球中級',0,NULL),('002334001','體育[男女合班]—排球高級',0,NULL),('002335001','體育[男女合班]—桌球中級',0,NULL),('002335011','體育[男女合班]—桌球中級',0,NULL),('002335021','體育[男女合班]—桌球中級',0,NULL),('002337001','體育[男女合班]—羽球中級',0,NULL),('002337011','體育[男女合班]—羽球中級',0,NULL),('002338001','體育[男女合班]—游泳中級',0,NULL),('002339001','體育[男女合班]—木球初級',0,NULL),('002339011','體育[男女合班]—木球初級',0,NULL),('002339031','體育[男女合班]—木球初級',0,NULL),('002339041','體育[男女合班]—木球初級',0,NULL),('002340011','體育[男女合班]—網球中級',0,NULL),('002340021','體育[男女合班]—網球中級',0,NULL),('002341001','體育[男女合班]—彼拉提斯墊上技巧',0,NULL),('002342001','體育[男女合班]—高低衝擊有氧初級',0,NULL),('002343001','體育[男女合班]—橄欖球初級',0,NULL),('002343011','體育[男女合班]—橄欖球初級',0,NULL),('002346001','體育[男女合班]—鐵人三項初級',0,NULL),('002347001','體育[男女合班]—健走',0,NULL),('002347021','體育[男女合班]—健走',0,NULL),('002348001','體育[男女合班]—跆拳道與防身術初級',0,NULL),('002348011','體育[男女合班]—跆拳道與防身術初級',0,NULL),('002350001','體育[男女合班]—武術初級',0,NULL),('002350011','體育[男女合班]—武術初級',0,NULL),('002355001','體育[男女合班]—武術中級',0,NULL),('002361011','體育[男女合班]—籃球初級',0,NULL),('002361021','體育[男女合班]—籃球初級',0,NULL),('002362001','體育[男女合班]—瑜珈初級',0,NULL),('002362011','體育[男女合班]—瑜珈初級',0,NULL),('002362021','體育[男女合班]—瑜珈初級',0,NULL),('002363001','體育[男女合班]—爵士舞初級',0,NULL),('002366001','體育[男女合班]—羽球初級',0,NULL),('002366011','體育[男女合班]—羽球初級',0,NULL),('002366041','體育[男女合班]—羽球初級',0,NULL),('002366071','體育[男女合班]—羽球初級',0,NULL),('002367001','體育[男女合班]—慢速壘球中級',0,NULL),('002368001','體育[男女合班]—定向越野',0,NULL),('002368011','體育[男女合班]—定向越野',0,NULL),('002368021','體育[男女合班]—定向越野',0,NULL),('002369001','體育[男女合班]—現代舞初級',0,NULL),('002371001','體育[男女合班]—國際標準舞初級（恰恰、探戈）',0,NULL),('002371011','體育[男女合班]—國際標準舞初級（恰恰、探戈）',0,NULL),('002373001','體育[男女合班]—田徑',0,NULL),('002373011','體育[男女合班]—田徑',0,NULL),('002374001','體育[男女合班]—田徑運動入門',0,NULL),('002374011','體育[男女合班]—田徑運動入門',0,NULL),('002377001','體育[男女合班]—綜合體能訓練',0,NULL),('002378001','體育[男女合班]—五人制足球',0,NULL),('002378011','體育[男女合班]—五人制足球',0,NULL),('002380001','體育[男女合班]—民俗體育',0,NULL),('002380011','體育[男女合班]—民俗體育',0,NULL),('002380021','體育[男女合班]—民俗體育',0,NULL),('002383001','體育[男女合班]—羽球高級',0,NULL),('002384001','體育[男女合班]—桌球高級',0,NULL),('002386001','體育[男女合班]—游泳初級（捷泳）',0,NULL),('002387001','體育[男女合班]—游泳初級',0,NULL),('002387011','體育[男女合班]—游泳初級',0,NULL),('002390001','體育[男女合班]—活力有氧初級',0,NULL),('002390011','體育[男女合班]—活力有氧初級',0,NULL),('002888001','體育[男女合班]—羽球實務（選修）',2,NULL),('031004011','國文－古典詩選讀',3,NULL),('031004051','國文－古典詩選讀',3,NULL),('031004061','國文－古典詩選讀',3,NULL),('031004081','國文－古典詩選讀',3,NULL),('031004091','國文－古典詩選讀',3,NULL),('031004101','國文－古典詩選讀',3,NULL),('031004111','國文－古典詩選讀',3,NULL),('031007011','國文－古典散文選讀',3,NULL),('031008011','國文－古典小說選讀',3,NULL),('031008021','國文－古典小說選讀',3,NULL),('031008031','國文－古典小說選讀',3,NULL),('031008041','國文－古典小說選讀',3,NULL),('031008051','國文－古典小說選讀',3,NULL),('031013011','國文－臺灣文學選讀',3,NULL),('031013041','國文－臺灣文學選讀',3,NULL),('031014161','國文－中國思想名作選讀',3,NULL),('031014171','國文－中國思想名作選讀',3,NULL),('031015011','國文─中國神話選讀',3,NULL),('031017101','國文－中國語言文字名作選讀',3,NULL),('031017111','國文－中國語言文字名作選讀',3,NULL),('031017121','國文－中國語言文字名作選讀',3,NULL),('031017131','國文－中國語言文字名作選讀',3,NULL),('031017141','國文－中國語言文字名作選讀',3,NULL),('031017151','國文－中國語言文字名作選讀',3,NULL),('031023001','國文－臺灣語言與文化選讀',3,NULL),('031023011','國文－臺灣語言與文化選讀',3,NULL),('031023021','國文－臺灣語言與文化選讀',3,NULL),('031024001','進階國文－近代小說選讀',3,NULL),('031025001','國文－入門班',3,NULL),('031026001','國文－基礎班',3,NULL),('031027001','國文－進階班',3,NULL),('032001011','大學英文（一）',3,NULL),('032001021','大學英文（一）',3,NULL),('032001031','大學英文（一）',3,NULL),('032001041','大學英文（一）',3,NULL),('032001051','大學英文（一）',3,NULL),('032001061','大學英文（一）',3,NULL),('032001071','大學英文（一）',3,NULL),('032001081','大學英文（一）',3,NULL),('032001091','大學英文（一）',3,NULL),('032001201','大學英文（一）',3,NULL),('032001211','大學英文（一）',3,NULL),('032001221','大學英文（一）',3,NULL),('032001231','大學英文（一）',3,NULL),('032001241','大學英文（一）',3,NULL),('032001251','大學英文（一）',3,NULL),('032001261','大學英文（一）',3,NULL),('032001271','大學英文（一）',3,NULL),('032001281','大學英文（一）',3,NULL),('032001291','大學英文（一）',3,NULL),('032001301','大學英文（一）',3,NULL),('032001311','大學英文（一）',3,NULL),('032001401','大學英文（一）',3,NULL),('032001411','大學英文（一）',3,NULL),('032001421','大學英文（一）',3,NULL),('032001431','大學英文（一）',3,NULL),('032001441','大學英文（一）',3,NULL),('032001451','大學英文（一）',3,NULL),('032001461','大學英文（一）',3,NULL),('032001471','大學英文（一）',3,NULL),('032001481','大學英文（一）',3,NULL),('032001491','大學英文（一）',3,NULL),('032001501','大學英文（一）',3,NULL),('032001511','大學英文（一）',3,NULL),('032001601','大學英文（一）',3,NULL),('032001611','大學英文（一）',3,NULL),('032001621','大學英文（一）',3,NULL),('032001631','大學英文（一）',3,NULL),('032001641','大學英文（一）',3,NULL),('032001651','大學英文（一）',3,NULL),('032001661','大學英文（一）',3,NULL),('032001671','大學英文（一）',3,NULL),('032001681','大學英文（一）',3,NULL),('032001691','大學英文（一）',3,NULL),('032001701','大學英文（一）',3,NULL),('032001711','大學英文（一）',3,NULL),('032001801','大學英文（一）',3,NULL),('032001811','大學英文（一）',3,NULL),('032001821','大學英文（一）',3,NULL),('032001831','大學英文（一）',3,NULL),('032001841','大學英文（一）',3,NULL),('032001881','大學英文（一）',3,NULL),('032001901','大學英文（一）',3,NULL),('032001911','大學英文（一）',3,NULL),('032001921','大學英文（一）',3,NULL),('032001931','大學英文（一）',3,NULL),('032001941','大學英文（一）',3,NULL),('032001951','大學英文（一）',3,NULL),('032002011','大學英文（二）',3,NULL),('032002021','大學英文（二）',3,NULL),('032002031','大學英文（二）',3,NULL),('032002041','大學英文（二）',3,NULL),('032002051','大學英文（二）',3,NULL),('032002061','大學英文（二）',3,NULL),('032002071','大學英文（二）',3,NULL),('032002081','大學英文（二）',3,NULL),('032002091','大學英文（二）',3,NULL),('032002201','大學英文（二）',3,NULL),('032002211','大學英文（二）',3,NULL),('032002221','大學英文（二）',3,NULL),('032002231','大學英文（二）',3,NULL),('032002241','大學英文（二）',3,NULL),('032002251','大學英文（二）',3,NULL),('032002261','大學英文（二）',3,NULL),('032002271','大學英文（二）',3,NULL),('032002281','大學英文（二）',3,NULL),('032002291','大學英文（二）',3,NULL),('032002301','大學英文（二）',3,NULL),('032002401','大學英文（二）',3,NULL),('032002411','大學英文（二）',3,NULL),('032002421','大學英文（二）',3,NULL),('032002431','大學英文（二）',3,NULL),('032002441','大學英文（二）',3,NULL),('032002451','大學英文（二）',3,NULL),('032002461','大學英文（二）',3,NULL),('032002471','大學英文（二）',3,NULL),('032002481','大學英文（二）',3,NULL),('032002491','大學英文（二）',3,NULL),('032002501','大學英文（二）',3,NULL),('032002511','大學英文（二）',3,NULL),('032002601','大學英文（二）',3,NULL),('032002611','大學英文（二）',3,NULL),('032002621','大學英文（二）',3,NULL),('032002631','大學英文（二）',3,NULL),('032002641','大學英文（二）',3,NULL),('032002651','大學英文（二）',3,NULL),('032002661','大學英文（二）',3,NULL),('032002671','大學英文（二）',3,NULL),('032002681','大學英文（二）',3,NULL),('032002691','大學英文（二）',3,NULL),('032002701','大學英文（二）',3,NULL),('032002711','大學英文（二）',3,NULL),('032002801','大學英文（二）',3,NULL),('032002811','大學英文（二）',3,NULL),('032002821','大學英文（二）',3,NULL),('032002831','大學英文（二）',3,NULL),('032002841','大學英文（二）',3,NULL),('032002881','大學英文（二）',3,NULL),('032002901','大學英文（二）',3,NULL),('032002911','大學英文（二）',3,NULL),('032002921','大學英文（二）',3,NULL),('032002931','大學英文（二）',3,NULL),('032002941','大學英文（二）',3,NULL),('032002951','大學英文（二）',3,NULL),('041026011','台灣歷史與文化',2,NULL),('041038001','當代台灣旅行文學欣賞',3,NULL),('041095001','客家語言與文化',3,NULL),('041097001','轉型期與近代東亞: 從1930年代到1940年代',2,NULL),('041099041','文明發展與歷史思惟',3,NULL),('041099061','文明發展與歷史思惟',3,NULL),('041100001','生命價值與哲學思惟',3,NULL),('041116001','語言與文化：以美式英文為例',3,NULL),('041123001','生命探索與宗教文化',3,NULL),('041125001','台灣現代文學選讀',3,NULL),('041133011','近代臺灣歷史與人物',3,NULL),('041135001','西方文學經典與人文思維',3,NULL),('041135011','西方文學經典與人文思維',3,NULL),('041172001','英美大眾小說：偵探和浪漫文類',3,NULL),('041177001','語言的人文與科學',3,NULL),('041177011','語言的人文與科學',3,NULL),('041177021','語言的人文與科學',3,NULL),('041179001','古代希臘的歷史與文化',2,NULL),('041187001','認識故宮名畫',3,NULL),('041191001','實用台灣閩南語',3,NULL),('041195001','藝術與當代社會',3,NULL),('041195011','藝術與當代社會',3,NULL),('041207001','解密生命樹：基督宗教傳統的跨時空之旅',3,NULL),('041211001','當代台灣電影、文化與社會',3,NULL),('041214001','俄羅斯文學、電影與藝術',3,NULL),('041215001','戲曲賞鑑與習藝實踐',3,NULL),('041216001','宗教朝聖與靈性旅遊',3,NULL),('041217001','語用學：跨文化與數位溝通',3,NULL),('042051001','經濟全球化與台商大陸投資',2,NULL),('042053001','歐洲政府與外交政策',2,NULL),('042089001','從漫畫看日本',2,NULL),('042096001','歐盟的兩岸政策',2,NULL),('042103001','由歷史事件看國際關係',2,NULL),('042112091','臺灣政治',3,NULL),('042116011','生活中的經濟學',3,NULL),('042116041','生活中的經濟學',3,NULL),('042131001','全球經濟與勞工問題',2,NULL),('042133001','社會學動動腦',3,NULL),('042133011','社會學動動腦',3,NULL),('042137001','法學素養',3,NULL),('042137011','法學素養',3,NULL),('042139021','認識智慧財產權',3,NULL),('042142001','環視全球－挑戰國際視野',3,NULL),('042142011','環視全球－挑戰國際視野',3,NULL),('042156001','中國大陸概論',3,NULL),('042156021','中國大陸概論',3,NULL),('042156031','中國大陸概論',3,NULL),('042156051','中國大陸概論',3,NULL),('042166001','國際法導論',2,NULL),('042181001','教育探索與自我學習',3,NULL),('042181011','教育探索與自我學習',3,NULL),('042183001','歐亞樞紐下的土耳其',3,NULL),('042194001','戰後日本外交史與經濟外交',2,NULL),('042195001','組織中的關係管理',3,NULL),('042198001','社會創新與未來創造',3,NULL),('042200001','認識勞資關係與勞動權益',2,NULL),('042201001','誰來審判？國民法官就是你',3,NULL),('042207001','地方創生入門',2,NULL),('042215001','人工智慧與社會',3,NULL),('042217001','AI、性別與勞動',3,NULL),('042219001','商標權管理與品牌競爭',2,NULL),('042220001','永續發展與地方創生',3,NULL),('042221001','人工智慧與法律',3,NULL),('042222001','人本交通與永續校園規劃',2,NULL),('043016001','生活中的生命科學',3,NULL),('043016011','生活中的生命科學',3,NULL),('043021001','探索遺傳特性',2,NULL),('043024001','物理學史與人類文明',3,NULL),('043025001','大腦與我',3,NULL),('043025011','大腦與我',3,NULL),('043027001','科技與人文社會',3,NULL),('043030001','數學、邏輯與人生',3,NULL),('043031001','心理與生活',3,NULL),('043033001','藥你康健、遠離毒惑（禍）',3,NULL),('043042001','醫病風險數據與醫療（照護）管理',2,NULL),('043045001','睡眠與健康',3,NULL),('043048001','星空捎來的信',3,NULL),('045023001','國小學生課後關懷與輔導',1,NULL),('045024011','圖書館實務及創意管理',2,NULL),('045025001','動物權：理論與實踐',1,NULL),('045062001','自主實踐學習２',2,NULL),('045064001','自主實踐學習１－１',1,NULL),('045065001','自主實踐學習１－２',1,NULL),('046001001','程式設計概論',3,NULL),('046001011','程式設計概論',3,NULL),('046001021','程式設計概論',3,NULL),('046001031','程式設計概論',3,NULL),('046005001','程式設計應用專題',3,NULL),('046006011','計算思維與人工智慧',3,NULL),('046006031','計算思維與人工智慧',3,NULL),('046008001','設計思維與軟體系統專案管理',3,NULL),('046008011','設計思維與軟體系統專案管理',3,NULL),('046008021','設計思維與軟體系統專案管理',3,NULL),('046009001','生成式人工智慧時代的生活紀實',3,NULL),('046010001','生活中的未來語言：數學、Python與AI',3,NULL),('090014011','生物技術導論',2,NULL),('090020001','認識中醫藥',2,NULL),('090033001','野生動物保育行銷',2,NULL),('090044001','藥物使用與生活的關係',2,NULL),('090060001','醫療與生活',2,NULL),('090060011','醫療與生活',2,NULL),('090060021','醫療與生活',2,NULL),('090066001','看的方法（紀錄片）',2,NULL),('090088001','預防醫學與校園健康',2,NULL),('090101001','西歐歷史建築',2,NULL),('090104001','長期照護與健康產業發展',2,NULL),('090106001','健康與生活',2,NULL),('090109001','仰望星空探索宇宙',2,NULL),('090111001','環境科學與環境保護',2,NULL),('090112001','自我探索與心理健康',2,NULL),('090114001','數位轉型的智權與風險管理',2,NULL),('090123001','舞蹈鑑賞',3,NULL),('090126001','聲音自媒體應用與創作',3,NULL),('090129001','Inkscape向量繪圖與雲端開放資源應用',2,NULL),('703001001','計算機概論 (Introduction to CS)',3,NULL),('703002001','線性代數 (Linear Algebra)',3,NULL),('703007001','離散數學 (Discrete Mathematics)',3,NULL),('703008001','資料結構 (Data Structures)',3,NULL),('703009001','物件導向程式設計 (Object-Oriented Programming)',3,NULL),('703010001','編譯器設計 (Compiler Design)',3,NULL),('703014001','數位系統設計 (Digital Systems Design)',3,NULL),('703015001','數位系統實驗 (Digital Systems Experiment)',3,NULL),('703016001','作業系統 (Operating Systems)',3,NULL),('703017001','機率論 (Probability & Statistics)',3,NULL),('703019001','計算機組織 (Computer Architecture)',3,NULL),('703022001','演算法 (Algorithms)',3,NULL),('703025001','資料庫系統 (Database System)',3,NULL),('703027001','計算機網路 (Computer Networks)',3,NULL),('703038001','人工智慧概論 (Artificial Intelligence Concept)',3,NULL),('703039001','軟體工程概論 (Software Engineering)',3,NULL),('703042001','等候理論',3,NULL),('703044001','資訊專題(A) (CS Project A)',3,NULL),('703046001','資訊專題(C) (CS Project C)',3,NULL),('703047001','資訊專題(D) (CS Project D)',3,NULL),('703049001','計算機程式設計（一） (Programming Guilds)',3,NULL),('703050001','計算機程式設計（二） (Programming Guilds)',3,NULL),('703053001','電腦圖學',3,NULL),('703055001','人機互動 (Machine Interaction)',3,NULL),('703059001','分散式系統',3,NULL),('703060001','資訊安全 (Information Safety)',3,NULL),('993015001','衛生保健',2,NULL),('993031001','戲劇音樂：人性',2,NULL);
/*!40000 ALTER TABLE `courses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `graduation_rules`
--

DROP TABLE IF EXISTS `graduation_rules`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `graduation_rules` (
  `rule_id` int NOT NULL AUTO_INCREMENT,
  `admission_year` int NOT NULL,
  `category_id` int NOT NULL,
  `min_courses` int DEFAULT NULL,
  `min_credits` int DEFAULT NULL,
  PRIMARY KEY (`rule_id`),
  KEY `category_id` (`category_id`),
  KEY `ix_graduation_rules_rule_id` (`rule_id`),
  CONSTRAINT `graduation_rules_ibfk_1` FOREIGN KEY (`category_id`) REFERENCES `course_categories` (`category_id`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `graduation_rules`
--

LOCK TABLES `graduation_rules` WRITE;
/*!40000 ALTER TABLE `graduation_rules` DISABLE KEYS */;
INSERT INTO `graduation_rules` VALUES (1,111,1,15,45),(2,111,2,2,6),(3,111,3,1,3),(4,111,4,1,3),(5,111,6,1,3),(6,111,10,NULL,2),(7,111,7,NULL,3),(8,111,8,NULL,3),(9,111,9,NULL,3),(10,111,12,1,3),(11,111,13,1,3),(12,111,14,1,3),(13,111,11,NULL,0),(14,111,15,2,6),(15,111,16,4,NULL);
/*!40000 ALTER TABLE `graduation_rules` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `required_courses`
--

DROP TABLE IF EXISTS `required_courses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `required_courses` (
  `admission_year` int NOT NULL,
  `course_id` varchar(20) NOT NULL,
  PRIMARY KEY (`admission_year`,`course_id`),
  KEY `course_id` (`course_id`),
  CONSTRAINT `required_courses_ibfk_1` FOREIGN KEY (`course_id`) REFERENCES `courses` (`course_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `required_courses`
--

LOCK TABLES `required_courses` WRITE;
/*!40000 ALTER TABLE `required_courses` DISABLE KEYS */;
INSERT INTO `required_courses` VALUES (111,'000713021'),(111,'000713022'),(111,'703001001'),(111,'703002001'),(111,'703007001'),(111,'703008001'),(111,'703009001'),(111,'703010001'),(111,'703014001'),(111,'703015001'),(111,'703016001'),(111,'703017001'),(111,'703019001'),(111,'703022001'),(111,'703025001'),(111,'703027001'),(111,'703038001'),(111,'703039001'),(111,'703042001'),(111,'703044001'),(111,'703046001'),(111,'703047001'),(111,'703049001'),(111,'703050001'),(111,'703053001'),(111,'703055001'),(111,'703059001'),(111,'703060001');
/*!40000 ALTER TABLE `required_courses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `student_course_records`
--

DROP TABLE IF EXISTS `student_course_records`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student_course_records` (
  `record_id` int NOT NULL AUTO_INCREMENT,
  `student_id` varchar(20) NOT NULL,
  `course_id` varchar(20) NOT NULL,
  `semester` varchar(20) NOT NULL,
  `grade` int DEFAULT NULL,
  `is_passed` tinyint(1) NOT NULL,
  PRIMARY KEY (`record_id`),
  KEY `student_id` (`student_id`),
  KEY `course_id` (`course_id`),
  KEY `ix_student_course_records_record_id` (`record_id`),
  CONSTRAINT `student_course_records_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `students` (`student_id`),
  CONSTRAINT `student_course_records_ibfk_2` FOREIGN KEY (`course_id`) REFERENCES `courses` (`course_id`)
) ENGINE=InnoDB AUTO_INCREMENT=138 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student_course_records`
--

LOCK TABLES `student_course_records` WRITE;
/*!40000 ALTER TABLE `student_course_records` DISABLE KEYS */;
INSERT INTO `student_course_records` VALUES (1,'111001001','703001001','111/1',88,1),(2,'111001001','000713021','111/1',75,1),(3,'111001001','000713022','111/2',72,1),(4,'111001001','703049001','111/2',85,1),(5,'111001001','703050001','112/1',90,1),(6,'111001001','703002001','112/1',78,1),(7,'111001001','703009001','112/1',82,1),(8,'111001001','703008001','112/2',76,1),(9,'111001001','703017001','112/2',70,1),(10,'111001001','703007001','112/2',68,1),(11,'111001001','703022001','113/1',80,1),(12,'111001001','703014001','113/1',74,1),(13,'111001001','703015001','113/1',85,1),(14,'111001001','703019001','113/2',79,1),(15,'111001001','703016001','113/2',83,1),(16,'111001001','703044001','113/1',88,1),(17,'111001001','703046001','113/2',84,1),(18,'111001001','703047001','114/1',90,1),(19,'111001001','703038001','112/2',77,1),(20,'111001001','703027001','113/1',81,1),(21,'111001001','703059001','113/2',75,1),(22,'111001001','032001011','111/1',82,1),(23,'111001001','032002011','111/2',79,1),(24,'111001001','031004011','111/2',85,1),(25,'111001001','046001001','112/1',78,1),(26,'111001001','043045001','112/2',80,1),(27,'111001001','043016001','113/1',86,1),(28,'111001001','042183001','112/1',75,1),(29,'111001001','042112091','112/2',82,1),(30,'111001001','042215001','113/2',77,1),(31,'111001001','041038001','111/2',88,1),(32,'111001001','041099041','112/1',83,1),(33,'111001001','041026011','113/1',79,1),(34,'111001001','045024011','114/1',90,1),(35,'111001001','002008011','111/1',80,1),(36,'111001001','002301001','111/2',85,1),(37,'111001001','002366001','112/1',90,1),(38,'111001001','002362001','112/2',88,1),(39,'111001002','703001001','111/1',85,1),(40,'111001002','000713021','111/1',70,1),(41,'111001002','000713022','111/2',68,1),(42,'111001002','703049001','111/2',82,1),(43,'111001002','703050001','112/1',88,1),(44,'111001002','703002001','112/1',74,1),(45,'111001002','703009001','112/1',79,1),(46,'111001002','703008001','112/2',73,1),(47,'111001002','703017001','112/2',67,1),(48,'111001002','703007001','112/2',65,1),(49,'111001002','703014001','113/1',71,1),(50,'111001002','703015001','113/1',83,1),(51,'111001002','703019001','113/2',76,1),(52,'111001002','703044001','113/1',85,1),(53,'111001002','703046001','113/2',80,1),(54,'111001002','703038001','112/2',75,1),(55,'111001002','703059001','113/2',72,1),(56,'111001002','032001021','111/1',78,1),(57,'111001002','031007011','111/2',83,1),(58,'111001002','046001011','112/1',76,1),(59,'111001002','043048001','112/2',78,1),(60,'111001002','043025001','113/1',82,1),(61,'111001002','042195001','112/1',74,1),(62,'111001002','042133001','112/2',80,1),(63,'111001002','041095001','111/2',85,1),(64,'111001002','041100001','112/1',81,1),(65,'111001002','045064001','114/1',88,1),(66,'111001002','002012011','111/1',82,1),(67,'111001002','002303011','111/2',85,1),(68,'111001002','002366011','112/1',88,1),(69,'111001002','002362011','112/2',90,1),(70,'111001003','703001001','111/1',90,1),(71,'111001003','000713021','111/1',78,1),(72,'111001003','000713022','111/2',75,1),(73,'111001003','703049001','111/2',88,1),(74,'111001003','703050001','112/1',92,1),(75,'111001003','703002001','112/1',80,1),(76,'111001003','703009001','112/1',84,1),(77,'111001003','703008001','112/2',77,1),(78,'111001003','703017001','112/2',72,1),(79,'111001003','703007001','112/2',70,1),(80,'111001003','703022001','113/1',83,1),(81,'111001003','703014001','113/1',76,1),(82,'111001003','703015001','113/1',87,1),(83,'111001003','703019001','113/2',81,1),(84,'111001003','703016001','113/2',85,1),(85,'111001003','703044001','113/1',90,1),(86,'111001003','703046001','113/2',86,1),(87,'111001003','703027001','113/1',79,1),(88,'111001003','703053001','113/2',77,1),(89,'111001003','032001031','111/1',85,1),(90,'111001003','032002031','111/2',82,1),(91,'111001003','031008011','111/2',87,1),(92,'111001003','046006011','112/1',80,1),(93,'111001003','043045001','112/1',78,1),(94,'111001003','043048001','112/2',75,1),(95,'111001003','043016001','113/1',83,1),(96,'111001003','043025001','113/2',80,1),(97,'111001003','042183001','112/1',76,1),(98,'111001003','042215001','112/2',79,1),(99,'111001003','041038001','111/2',84,1),(100,'111001003','041026011','112/1',77,1),(101,'111001003','045024011','114/1',88,1),(102,'111001003','002021011','111/1',85,1),(103,'111001003','002301021','111/2',88,1),(104,'111001003','002366041','112/1',90,1),(105,'111001003','002362021','112/2',85,1),(106,'111001004','703001001','111/1',82,1),(107,'111001004','000713021','111/1',68,1),(108,'111001004','000713022','111/2',65,1),(109,'111001004','703049001','111/2',80,1),(110,'111001004','703050001','112/1',85,1),(111,'111001004','703002001','112/1',72,1),(112,'111001004','703009001','112/1',77,1),(113,'111001004','703008001','112/2',70,1),(114,'111001004','703017001','112/2',65,1),(115,'111001004','703007001','112/2',63,1),(116,'111001004','703022001','113/1',78,1),(117,'111001004','703014001','113/1',70,1),(118,'111001004','703015001','113/1',82,1),(119,'111001004','703019001','113/2',75,1),(120,'111001004','703016001','113/2',80,1),(121,'111001004','703044001','113/1',85,1),(122,'111001004','703046001','113/2',80,1),(123,'111001004','703038001','112/2',74,1),(124,'111001004','703042001','113/2',71,1),(125,'111001004','032001041','111/1',76,1),(126,'111001004','032002041','111/2',73,1),(127,'111001004','031013011','111/2',80,1),(128,'111001004','046008001','112/1',75,1),(129,'111001004','043033001','112/2',72,1),(130,'111001004','043027001','113/1',78,1),(131,'111001004','041125001','111/2',82,1),(132,'111001004','041123001','112/1',79,1),(133,'111001004','045062001','114/1',85,1),(134,'111001004','002008011','111/1',80,1),(135,'111001004','002303021','111/2',83,1),(136,'111001004','002366071','112/1',88,1),(137,'111001004','002362001','112/2',82,1);
/*!40000 ALTER TABLE `student_course_records` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `students`
--

DROP TABLE IF EXISTS `students`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `students` (
  `student_id` varchar(20) NOT NULL,
  `name` varchar(100) NOT NULL,
  `admission_year` int NOT NULL,
  `department` varchar(100) NOT NULL,
  PRIMARY KEY (`student_id`),
  KEY `ix_students_student_id` (`student_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `students`
--

LOCK TABLES `students` WRITE;
/*!40000 ALTER TABLE `students` DISABLE KEYS */;
INSERT INTO `students` VALUES ('111001001','王大明',111,'資訊科學系'),('111001002','李小華',111,'資訊科學系'),('111001003','張美玲',111,'資訊科學系'),('111001004','陳志豪',111,'資訊科學系');
/*!40000 ALTER TABLE `students` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `user_id` int NOT NULL AUTO_INCREMENT,
  `student_id` varchar(20) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  PRIMARY KEY (`user_id`),
  UNIQUE KEY `student_id` (`student_id`),
  UNIQUE KEY `username` (`username`),
  KEY `ix_users_user_id` (`user_id`),
  CONSTRAINT `users_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `students` (`student_id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'111001001','111001001','$2b$12$L8eutELI6MmHkUHk4Tvs/.FxsfiPQd6sF0AF.4HHL3HXNVDQxk8XW'),(2,'111001002','111001002','$2b$12$vut22VJSYZvh7XdYU0eRiuEe7WEenRBNUhsgVx4VhgmGeC6tP12Iu'),(3,'111001003','111001003','$2b$12$2cUVH0DJONrJgDPiBNRNs.sPAFLcH7Jr/3MxQNbn3s2oPoyJ2FcoG'),(4,'111001004','111001004','$2b$12$n/lRDb8w98ciKh6cDdaxK.fuJLkxcBVgaDFGJy1eZZhTFQU4PnJcu');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-06-08 18:06:30
